package core.UI;
/** Ваша задача - автоматизировать открытие главной страницы сайта https://dzen.ru/,
 и переход с неё на страницу https://dzen.ru/subscriptions-manager, после чего - успешный ввод

 Requirements:
 1. Используется chrome driver
 2. Используется CSS локатор для первого теста в классе, xPath - для второго
 3. Присутствует проверка, что сайт успешно открылся - проверка осуществляется на отображение логотипа "Дзен" в шапке сайта
 4. Присутствует проверка, что есть кнопка "Войти" - на экране подписки, не в шапке главного.
 5. Присутствует проверка, что по нажатию на кнопку "Войти" предлагается 2 типа входа
 **/
public class OpenSubscriptionsScreen {
}
